## DataFrames

- List of Dictionary / Tuple of Dictionary:
    - Key names must be same
- from dictionary with "list" as value
    - Length of list must be same
- From List of List

##### List of Dictionary / Tuple of Dictionary

In [3]:
import pandas as pd
list1 = [ { 'Name' : "A" , 'Age' : 25 , "Gen ": "F" } , { 'Name' : "C" , 'Age' : 23 , "Gen ": "F" } , { 'Name' : "D" , 'Age' : 27 , "Gen ": "M" }]
df = pd.DataFrame(list1)
df

   Age Gen  Name
0   25    F    A
1   23    F    C
2   27    M    D

##### from dictionary with "list" as value

In [4]:
data = { "Name" : ['A' ,'B' ,'C' ], "Age" : [ 23,21,23] , "Gender" : [ 'M' ,'F' ,'F'] }
pd.DataFrame(data )

  Name  Age Gender
0    A   23      M
1    B   21      F
2    C   23      F

In [8]:
data = pd.DataFrame({ 'price':[95, 85, 41, 78,65],
                     'ticker':['AXP', 'CSCO', 'DIS', 'MSFT', 'WMT'],
                     'company':['American Express', 'Cisco', 'Walt Disney','Microsoft', 'Walmart']})
data

   price ticker           company
0     95    AXP  American Express
1     85   CSCO             Cisco
2     41    DIS       Walt Disney
3     78   MSFT         Microsoft
4     65    WMT           Walmart

##### from List of List

In [17]:
lst = [ ['A' ,'B' ,'C'] , [ 20,22,24] , ['F','M','F']  ]
pd.DataFrame (lst)

    0   1   2
0   A   B   C
1  20  22  24
2   F   M   F

In [16]:
lst = [ ['A' ,'B' ,'C'] , [ 20,22,24] , ['F','M','F']  ]
pd.DataFrame (lst, columns = ['Name' ,'Age' ,'Gen'], index = [11,12,13])

   Name Age Gen
11    A   B   C
12   20  22  24
13    F   M   F

### Column Slicing

In [79]:
GL = ({"Location":"Bangalore","Jan":150,"Feb":80},
     {"Location":"Chennai","Jan":200,"Feb":70})
df = pd.DataFrame(GL)
df

   Feb  Jan   Location
0   80  150  Bangalore
1   70  200    Chennai

In [80]:
df['Jan']

0    150
1    200
Name: Jan, dtype: int64

In [21]:
df['Jan'][0]

150

In [27]:
df[ ['Jan' ,'Feb'] ]  #MUST BE IN  A LIST

   Jan  Feb
0  150   80
1  200   70

In [30]:
df.Feb

0    80
1    70
Name: Feb, dtype: int64

In [31]:
df.Feb[1]

70

### .shape

In [33]:
df.shape

(2, 3)

#### .describe()

In [38]:
df.describe()

             Feb         Jan
count   2.000000    2.000000
mean   75.000000  175.000000
std     7.071068   35.355339
min    70.000000  150.000000
25%    72.500000  162.500000
50%    75.000000  175.000000
75%    77.500000  187.500000
max    80.000000  200.000000

In [40]:
df.describe(include = "all")

              Feb         Jan Location
count    2.000000    2.000000        2
unique        NaN         NaN        2
top           NaN         NaN  Chennai
freq          NaN         NaN        1
mean    75.000000  175.000000      NaN
std      7.071068   35.355339      NaN
min     70.000000  150.000000      NaN
25%     72.500000  162.500000      NaN
50%     75.000000  175.000000      NaN
75%     77.500000  187.500000      NaN
max     80.000000  200.000000      NaN

#### .info()

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
Feb         2 non-null int64
Jan         2 non-null int64
Location    2 non-null object
dtypes: int64(2), object(1)
memory usage: 128.0+ bytes

### Row Slicing

In [51]:
data = { "Name" : ['A' ,'B' ,'C' ,'D','E'], "Age" : [ 23,21,24,27,23] , "Gender" : [ 'M' ,'F' ,'F','M','M'] }
df=pd.DataFrame(data )
df

  Name  Age Gender
0    A   23      M
1    B   21      F
2    C   24      F
3    D   27      M
4    E   23      M

In [50]:
#First 3 rows
df.iloc[0:3:1]

  Name  Age Gender
0    A   23      M
1    B   21      F
2    C   24      F

In [52]:
#first and third row
df.iloc[0:3:2]

  Name  Age Gender
0    A   23      M
2    C   24      F

In [55]:
# 0,2,3 row then use Lists

df.iloc[ [0,2,3] ]

  Name  Age Gender
0    A   23      M
2    C   24      F
3    D   27      M

## loc()

In [57]:
data = { "Name" : ['A' ,'B' ,'C' ,'D','E'], "Age" : [ 23,21,24,27,23] , "Gender" : [ 'M' ,'F' ,'F','M','M'] }
df=pd.DataFrame(data , index = [ 10,20,30,40,50] )
df

   Name  Age Gender
10    A   23      M
20    B   21      F
30    C   24      F
40    D   27      M
50    E   23      M

In [60]:
df.loc[ [10,30,40] ]

   Name  Age Gender
10    A   23      M
30    C   24      F
40    D   27      M

In [65]:
df.loc [10:40:2]

   Name  Age Gender
10    A   23      M
30    C   24      F

In [66]:
df.loc [ 0:3:2]

Empty DataFrame
Columns: [Name, Age, Gender]
Index: []

In [67]:
data = { "Name" : ['A' ,'B' ,'C' ,'D','E'], "Age" : [ 23,21,24,27,23] , "Gender" : [ 'M' ,'F' ,'F','M','M'] }
df=pd.DataFrame(data , index = [ 'ab' ,'cd' , 'hi' ,'xy' ,'mn'] )
df

   Name  Age Gender
ab    A   23      M
cd    B   21      F
hi    C   24      F
xy    D   27      M
mn    E   23      M

In [68]:
df. loc [ 'ab' :'xy']

   Name  Age Gender
ab    A   23      M
cd    B   21      F
hi    C   24      F
xy    D   27      M

In [69]:
df.iloc [ 0:3]

   Name  Age Gender
ab    A   23      M
cd    B   21      F
hi    C   24      F

## Row & Column Slicing

In [70]:
data = { "Name" : ['A' ,'B' ,'C' ,'D','E'], "Age" : [ 23,21,24,27,23] , "Gender" : [ 'M' ,'F' ,'F','M','M'] }
df=pd.DataFrame(data )
df

  Name  Age Gender
0    A   23      M
1    B   21      F
2    C   24      F
3    D   27      M
4    E   23      M

In [71]:
df.iloc [ 0:3:1 , 0:2:1 ]

  Name  Age
0    A   23
1    B   21
2    C   24

In [78]:
df.iloc [ [0,1,2] , [0,1] ]

  Name  Age
0    A   23
1    B   21
2    C   24

In [77]:
df.loc [0:2:1 , 'Name' : 'Age' :1]

  Name  Age
0    A   23
1    B   21
2    C   24